{
  "backend": "tensorflow",
  "keras_version": "2.0.6",
  "class_name": "Model",
  "config": {
    "input_layers": [
      [
        "input_1",
        0,
        0
      ]
    ],
    "layers": [
      {
        "config": {
          "sparse": false,
          "name": "input_1",
          "dtype": "float32",
          "batch_input_shape": [
            null,
            256,
            256,
            1
          ]
        },
        "class_name": "InputLayer",
        "inbound_nodes": [],
        "name": "input_1"
      },
      {
        "config": {
          "use_bias": true,
          "trainable": true,
          "filters": 96,
          "strides": [
            4,
            4
          ],
          "kernel_size": [
            8,
            8
          ],
          "bias_constraint": null,
          "bias_regularizer": null,
          "kernel_regularizer": null,
          "activation": "linear",
          "padding": "same",
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "seed": null,
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform"
            }
          },
          "dilation_rate": [
            1,
            1
          ],
          "name": "conv2d_1",
          "activity_regularizer": null,
          "kernel_constraint": null,
          "data_format": "channels_last"
        },
        "class_name": "Conv2D",
        "inbound_nodes": [
          [
            [
              "input_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_1"
      },
      {
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_1"
        },
        "class_name": "Activation",
        "inbound_nodes": [
          [
            [
              "conv2d_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_1"
      },
      {
        "config": {
          "trainable": true,
          "strides": [
            2,
            2
          ],
          "name": "max_pooling2d_1",
          "data_format": "channels_last",
          "padding": "valid",
          "pool_size": [
            3,
            3
          ]
        },
        "class_name": "MaxPooling2D",
        "inbound_nodes": [
          [
            [
              "activation_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "max_pooling2d_1"
      },
      {
        "config": {
          "use_bias": true,
          "trainable": true,
          "filters": 256,
          "strides": [
            1,
            1
          ],
          "kernel_size": [
            5,
            5
          ],
          "bias_constraint": null,
          "bias_regularizer": null,
          "kernel_regularizer": null,
          "activation": "linear",
          "padding": "same",
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "seed": null,
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform"
            }
          },
          "dilation_rate": [
            1,
            1
          ],
          "name": "conv2d_2",
          "activity_regularizer": null,
          "kernel_constraint": null,
          "data_format": "channels_last"
        },
        "class_name": "Conv2D",
        "inbound_nodes": [
          [
            [
              "max_pooling2d_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_2"
      },
      {
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_2"
        },
        "class_name": "Activation",
        "inbound_nodes": [
          [
            [
              "conv2d_2",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_2"
      },
      {
        "config": {
          "trainable": true,
          "strides": [
            2,
            2
          ],
          "name": "max_pooling2d_2",
          "data_format": "channels_last",
          "padding": "valid",
          "pool_size": [
            3,
            3
          ]
        },
        "class_name": "MaxPooling2D",
        "inbound_nodes": [
          [
            [
              "activation_2",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "max_pooling2d_2"
      },
      {
        "config": {
          "use_bias": true,
          "trainable": true,
          "filters": 384,
          "strides": [
            1,
            1
          ],
          "kernel_size": [
            3,
            3
          ],
          "bias_constraint": null,
          "bias_regularizer": null,
          "kernel_regularizer": null,
          "activation": "linear",
          "padding": "same",
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "seed": null,
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform"
            }
          },
          "dilation_rate": [
            1,
            1
          ],
          "name": "conv2d_3",
          "activity_regularizer": null,
          "kernel_constraint": null,
          "data_format": "channels_last"
        },
        "class_name": "Conv2D",
        "inbound_nodes": [
          [
            [
              "max_pooling2d_2",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_3"
      },
      {
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_3"
        },
        "class_name": "Activation",
        "inbound_nodes": [
          [
            [
              "conv2d_3",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_3"
      },
      {
        "config": {
          "use_bias": true,
          "trainable": true,
          "filters": 384,
          "strides": [
            1,
            1
          ],
          "kernel_size": [
            3,
            3
          ],
          "bias_constraint": null,
          "bias_regularizer": null,
          "kernel_regularizer": null,
          "activation": "linear",
          "padding": "same",
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "seed": null,
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform"
            }
          },
          "dilation_rate": [
            1,
            1
          ],
          "name": "conv2d_4",
          "activity_regularizer": null,
          "kernel_constraint": null,
          "data_format": "channels_last"
        },
        "class_name": "Conv2D",
        "inbound_nodes": [
          [
            [
              "activation_3",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_4"
      },
      {
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_4"
        },
        "class_name": "Activation",
        "inbound_nodes": [
          [
            [
              "conv2d_4",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_4"
      },
      {
        "config": {
          "use_bias": true,
          "trainable": true,
          "filters": 256,
          "strides": [
            1,
            1
          ],
          "kernel_size": [
            3,
            3
          ],
          "bias_constraint": null,
          "bias_regularizer": null,
          "kernel_regularizer": null,
          "activation": "linear",
          "padding": "same",
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "seed": null,
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform"
            }
          },
          "dilation_rate": [
            1,
            1
          ],
          "name": "conv2d_5",
          "activity_regularizer": null,
          "kernel_constraint": null,
          "data_format": "channels_last"
        },
        "class_name": "Conv2D",
        "inbound_nodes": [
          [
            [
              "activation_4",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_5"
      },
      {
        "config": {
          "trainable": true,
          "activation": "relu",
          "name": "activation_5"
        },
        "class_name": "Activation",
        "inbound_nodes": [
          [
            [
              "conv2d_5",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_5"
      },
      {
        "config": {
          "trainable": true,
          "strides": [
            2,
            2
          ],
          "name": "max_pooling2d_3",
          "data_format": "channels_last",
          "padding": "valid",
          "pool_size": [
            3,
            3
          ]
        },
        "class_name": "MaxPooling2D",
        "inbound_nodes": [
          [
            [
              "activation_5",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "max_pooling2d_3"
      },
      {
        "config": {
          "trainable": true,
          "name": "flatten_1"
        },
        "class_name": "Flatten",
        "inbound_nodes": [
          [
            [
              "max_pooling2d_3",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "flatten_1"
      },
      {
        "config": {
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "trainable": true,
          "activity_regularizer": null,
          "bias_regularizer": null,
          "bias_constraint": null,
          "kernel_regularizer": null,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "seed": null,
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform"
            }
          },
          "name": "dense_1",
          "kernel_constraint": null,
          "units": 4096
        },
        "class_name": "Dense",
        "inbound_nodes": [
          [
            [
              "flatten_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "dense_1"
      },
      {
        "config": {
          "rate": 0.5,
          "trainable": true,
          "name": "dropout_1"
        },
        "class_name": "Dropout",
        "inbound_nodes": [
          [
            [
              "dense_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "dropout_1"
      },
      {
        "config": {
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "trainable": true,
          "activity_regularizer": null,
          "bias_regularizer": null,
          "bias_constraint": null,
          "kernel_regularizer": null,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "seed": null,
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform"
            }
          },
          "name": "dense_2",
          "kernel_constraint": null,
          "units": 4096
        },
        "class_name": "Dense",
        "inbound_nodes": [
          [
            [
              "dropout_1",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "dense_2"
      },
      {
        "config": {
          "rate": 0.5,
          "trainable": true,
          "name": "dropout_2"
        },
        "class_name": "Dropout",
        "inbound_nodes": [
          [
            [
              "dense_2",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "dropout_2"
      },
      {
        "config": {
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "trainable": true,
          "activity_regularizer": null,
          "bias_regularizer": null,
          "bias_constraint": null,
          "kernel_regularizer": null,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "seed": null,
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform"
            }
          },
          "name": "dense_3",
          "kernel_constraint": null,
          "units": 26
        },
        "class_name": "Dense",
        "inbound_nodes": [
          [
            [
              "dropout_2",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "dense_3"
      }
    ],
    "output_layers": [
      [
        "dense_3",
        0,
        0
      ]
    ],
    "name": "model_1"
  }
}